#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      + data             = (sensitive value)
      + data_json        = (sensitive value)
      + id               = (known after apply)
      + lease_duration   = (known after apply)
      + lease_id         = (known after apply)
      + lease_renewable  = (known after apply)
      + lease_start_time = (known after apply)
      + path             = "secret/suitable/terraform/stackdriver/slack-token"
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        display_name = "perf"
        enabled      = true
        id           = "projects/broad-jade-perf/notificationChannels/3869773518729165502"
      ~ labels       = {
          - "auth_token"   = "xoxb-12729891575-1301495169890-SUYNuZWXKWTdFGkT4W07MfGg"
          - "channel_name" = "#jade-alerts"
        } -> (known after apply)
        name         = "projects/broad-jade-perf/notificationChannels/3869773518729165502"
        project      = "broad-jade-perf"
        type         = "slack"
        user_labels  = {}
    }

  # module.datarepo-app.google_project_iam_member.test_runner_sa_role[4] will be created
  + resource "google_project_iam_member" "test_runner_sa_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:datarepo-jade-test-runner@broad-jade-perf.iam.gserviceaccount.com"
      + project = "broad-jade-perf"
      + role    = "roles/resourcemanager.projectIamAdmin"
    }

  # module.core-infrastructure.module.k8s-master.google_container_cluster.cluster will be updated in-place
  ~ resource "google_container_cluster" "cluster" {
        additional_zones            = []
        cluster_ipv4_cidr           = "10.127.0.0/20"
        default_max_pods_per_node   = 110
        enable_binary_authorization = false
        enable_intranode_visibility = false
        enable_kubernetes_alpha     = false
        enable_legacy_abac          = false
        enable_shielded_nodes       = false
        enable_tpu                  = false
        endpoint                    = "35.225.67.152"
        id                          = "projects/broad-jade-perf/locations/us-central1/clusters/jade-master-us-central1"
        initial_node_count          = 1
        instance_group_urls         = [
            "https://www.googleapis.com/compute/beta/projects/broad-jade-perf/zones/us-central1-b/instanceGroups/gke-jade-master-us-c-jade-node-us-cen-9882063a-grp",
            "https://www.googleapis.com/compute/beta/projects/broad-jade-perf/zones/us-central1-f/instanceGroups/gke-jade-master-us-c-jade-node-us-cen-3bc30001-grp",
            "https://www.googleapis.com/compute/beta/projects/broad-jade-perf/zones/us-central1-c/instanceGroups/gke-jade-master-us-c-jade-node-us-cen-a9e0e551-grp",
        ]
        label_fingerprint           = "a9dc16a7"
        location                    = "us-central1"
        logging_service             = "logging.googleapis.com/kubernetes"
        master_version              = "1.16.13-gke.401"
        min_master_version          = "1.16.13-gke.401"
        monitoring_service          = "monitoring.googleapis.com/kubernetes"
        name                        = "jade-master-us-central1"
        network                     = "projects/broad-jade-perf/global/networks/perf-network"
        networking_mode             = "VPC_NATIVE"
        node_locations              = [
            "us-central1-b",
            "us-central1-c",
            "us-central1-f",
        ]
        node_version                = "1.16.13-gke.401"
        project                     = "broad-jade-perf"
        remove_default_node_pool    = true
        resource_labels             = {}
        services_ipv4_cidr          = "10.0.16.0/20"
        subnetwork                  = "projects/broad-jade-perf/regions/us-central1/subnetworks/perf-subnet"

        addons_config {

            istio_config {
                disabled = true
            }

            network_policy_config {
                disabled = false
            }
        }

        cluster_autoscaling {
            autoscaling_profile = "BALANCED"
            enabled             = false
        }

        cluster_telemetry {
            type = "ENABLED"
        }

        database_encryption {
            state = "DECRYPTED"
        }

        ip_allocation_policy {
            cluster_ipv4_cidr_block       = "10.127.0.0/20"
            cluster_secondary_range_name  = "pods"
            services_ipv4_cidr_block      = "10.0.16.0/20"
            services_secondary_range_name = "services"
        }

        master_auth {
            client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMyakNDQWNLZ0F3SUJBZ0lRRjAxTjNQYkZzRWRZZkllS2Z2c3A0ekFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlRNU9HRm1ZbVU1WmkwNU5ESTFMVFExTWpRdFlqa3dNUzFoWmpOa05EYzVNV1l4TWpndwpIaGNOTWpBd05qSTJNVGN4TkRVMldoY05NalV3TmpJMU1UY3hORFUyV2pBUk1ROHdEUVlEVlFRREV3WmpiR2xsCmJuUXdnZ0VpTUEwR0NTcUdTSWIzRFFFQkFRVUFBNElCRHdBd2dnRUtBb0lCQVFDV3ZlVC9nQ0lweFBGTXVFWFcKNCtFRGVJK2xLVmVpQy9lNjRJRDBNRVdPL3hia2FXOGo0aDJGWTc0M05VbGh6ZThVRk9qdWRYYkpqRHRQV2NuSQpEWFkzcEVGUXR4cXFLOHpFeW5YcmdlNDh1ZzVYTGMyRDJVYit0YjhFNm94QlRtMzJtUUJQQm4xZVEyQlhZT0xlCkh4aFZ3ZFdWNzh6Tjh0TkNiNnhoR2h4VUNiWGJvOFBDNkNLZnZ6dncxdFNmV0lQd3pNeFBQbVBEYkJVbml5STkKMmg2b1NNTE8zelo1Y3FJVUhwQWtTazYzNDJoQkREbHMxTXpFZCtsc0s2WDE5eitaZXFiMkw2aXJ3aERBc2djLwpFSDhKY3NHNUNGeGVSTEZNS0tpNkk2cEdUK0M2Q2tGWWNlNHNUUmdTdDZjY1F3RHpabmt0WFY4NjFvWmt0MTEyCjJPNlJBZ01CQUFHakVEQU9NQXdHQTFVZEV3RUIvd1FDTUFBd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFFeSsKeURsdGt1Y29iNm9HMTQ4bDNJZUxwVkVoRkxTTjNBcUE1Q1lnUmdnVEpidHV2N2Y2T1R6STB2Smt5QnRuMDFoYQovcTVvenRuRDVYenc2b2hWd29PTFVmZWtaNStWL2VabW9GYURWQUM2WkFQMElyMTMwSmhZRnIrSnA2d0pTaGZJCmwrM1J2VFZUSEhKbm9QQk1tSGY2TEc3TEN1WTZ2UVdLRHMvK0VIU2dBOTFNeUxtQlJLSkNwZDVaNE9zSlFJclMKdE51eGJ6U3VUR2g0VXF4WFVSMFl2MUdsVFRkNEJBc25yNHdnVXFaZi81Ykc5V1dXQ1l3OFJDeExZYmlwTW02aAoxMzlQS0tHaW5sRjF0QzFHRG1BWmhCTGlvNStUVjQ4VXZQWUZwNEpCRFpodWtNUUlZSVNXTEtETjNWay9yR1NSClNGQjJ1cmkyUW43ZEVsNUdaQlk9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            client_key             = (sensitive value)
            cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURERENDQWZTZ0F3SUJBZ0lSQUpQQmRWTUxBa2hTNDJLQStaTGZnVDR3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa09UaGhabUpsT1dZdE9UUXlOUzAwTlRJMExXSTVNREV0WVdZelpEUTNPVEZtTVRJNApNQjRYRFRJd01EWXlOakUyTVRRMU5Wb1hEVEkxTURZeU5URTNNVFExTlZvd0x6RXRNQ3NHQTFVRUF4TWtPVGhoClptSmxPV1l0T1RReU5TMDBOVEkwTFdJNU1ERXRZV1l6WkRRM09URm1NVEk0TUlJQklqQU5CZ2txaGtpRzl3MEIKQVFFRkFBT0NBUThBTUlJQkNnS0NBUUVBdHhDaklUMkVaS0NnZjZVOS8yRnhJRVhHUXNZZkZEVUptaEExM0tiRgpuVXBWME0yWHBlVGp4NnF2ZHVwZ1NkSk84d1FrOHFxUkxuYXFJeEROSHgrMTZBOE5PUTF0aEd5WVczb1paZTdTCjZuaHFOL2ExWWZxV215bU90N2lGeXZNaWVVUFFUOEg1S0YreXhWc09yR2wxejA5U29qK1ovcVBiblREWUFNWlEKVUo4dDhLNDliWGlpOENUeUovYVFSelpxTFIzZU9kcXMxUTlzc0xPVVZBWkorRmgxc2FZUUdaT2l2bmQ0WWtiNgptZmdhOHpXeEdqdXgyRmpuSVg4cEJ6Rlk0N0R3VE1WT1JpMzJXRkp4Qm5zY0VUOHpwUFlwOHd4RXZtTUU2SnI5CnlJM2E2c0tzdi9IUFVuV0VsNDJLREZqWWtwM1ZzZFpyU0ZUcENySUYzczhoMVFJREFRQUJveU13SVRBT0JnTlYKSFE4QkFmOEVCQU1DQWdRd0R3WURWUjBUQVFIL0JBVXdBd0VCL3pBTkJna3Foa2lHOXcwQkFRc0ZBQU9DQVFFQQpzTDRmekhsNklDcHBVbWplWHhHZ2wwZEc2YklEMiswcjR5aWIrWkZQUng0Uit1OTdqZUpsdnZ5NEZUYXhJUy9CCk52aW5XZWd2V09GTDdVU1g3cnZicnpIWFhXNDJqMERzRzg5cW5vTEYvUVhVMHlCVVFlQllsNWpvdk5TRTdxMXMKalI4RXBaa2trT0FiZC9aSU1tbXVhaW9mZkhWWit0UVpuWGhuT3NSOXh2M05tZ3V6cm01SlA2S3R5NUt1RFBoSAphdk9iVTM2ajIrTHZRYmdPRmVhbktJS1p1cHE0MlNVemxBZXpvNWxnMVRxc2pNRVJtaVg4YW5vY28zZ3g3dzRTCjgveWRBemZhYUoxMWZzNU9SQldXM20wTDhjQVpnVWtNdnhMSXJrc09SN3JSUmI3QXB1Tk4zL3ljNmpsVmpIT0sKekQwNFY5eGtleTZZRVZjblJvRGpQUT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"

            client_certificate_config {
                issue_client_certificate = true
            }
        }

      ~ master_authorized_networks_config {
          - cidr_blocks {
              - cidr_block = "34.70.76.7/32" -> null
            }
          + cidr_blocks {
              + cidr_block = "34.70.76.7/32"
            }
          - cidr_blocks {
              - cidr_block = "35.202.125.180/32" -> null
            }
          + cidr_blocks {
              + cidr_block = "35.202.125.180/32"
            }
          - cidr_blocks {
              - cidr_block = "52.167.221.205/32" -> null
            }
          - cidr_blocks {
              - cidr_block = "69.173.112.0/21" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.112.0/21"
            }
          - cidr_blocks {
              - cidr_block = "69.173.120.0/22" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.120.0/22"
            }
          - cidr_blocks {
              - cidr_block = "69.173.124.0/23" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.124.0/23"
            }
          - cidr_blocks {
              - cidr_block = "69.173.126.0/24" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.126.0/24"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.0/25" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.0/25"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.128/26" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.128/26"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.192/27" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.192/27"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.224/30" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.224/30"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.228/32" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.228/32"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.230/31" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.230/31"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.232/29" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.232/29"
            }
          - cidr_blocks {
              - cidr_block = "69.173.127.240/28" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.127.240/28"
            }
          - cidr_blocks {
              - cidr_block = "69.173.64.0/19" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.64.0/19"
            }
          - cidr_blocks {
              - cidr_block = "69.173.96.0/20" -> null
            }
          + cidr_blocks {
              + cidr_block = "69.173.96.0/20"
            }
        }

        network_policy {
            enabled = true
        }

        node_config {
            disk_size_gb      = 50
            disk_type         = "pd-standard"
            guest_accelerator = []
            image_type        = "COS"
            labels            = {
                "environment" = "jade"
                "project"     = "broad-jade-perf"
            }
            local_ssd_count   = 0
            machine_type      = "n1-standard-2"
            metadata          = {
                "disable-legacy-endpoints"         = "true"
                "google-compute-enable-virtio-rng" = "false"
            }
            oauth_scopes      = [
                "https://www.googleapis.com/auth/compute",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
            ]
            preemptible       = false
            service_account   = "default"
            tags              = [
                "broad-jade-perf",
                "jade",
                "kubernetes",
            ]
            taint             = []

            shielded_instance_config {
                enable_integrity_monitoring = true
                enable_secure_boot          = false
            }

            workload_metadata_config {
                node_metadata = "GKE_METADATA_SERVER"
            }
        }

        node_pool {
            initial_node_count  = 1
            instance_group_urls = [
                "https://www.googleapis.com/compute/v1/projects/broad-jade-perf/zones/us-central1-b/instanceGroupManagers/gke-jade-master-us-c-jade-node-us-cen-9882063a-grp",
                "https://www.googleapis.com/compute/v1/projects/broad-jade-perf/zones/us-central1-f/instanceGroupManagers/gke-jade-master-us-c-jade-node-us-cen-3bc30001-grp",
                "https://www.googleapis.com/compute/v1/projects/broad-jade-perf/zones/us-central1-c/instanceGroupManagers/gke-jade-master-us-c-jade-node-us-cen-a9e0e551-grp",
            ]
            max_pods_per_node   = 110
            name                = "jade-node-us-central1"
            node_count          = 1
            node_locations      = [
                "us-central1-b",
                "us-central1-c",
                "us-central1-f",
            ]
            version             = "1.16.13-gke.401"

            management {
                auto_repair  = true
                auto_upgrade = true
            }

            node_config {
                disk_size_gb      = 50
                disk_type         = "pd-standard"
                guest_accelerator = []
                image_type        = "COS"
                labels            = {
                    "environment" = "jade"
                    "project"     = "broad-jade-perf"
                }
                local_ssd_count   = 0
                machine_type      = "n1-standard-2"
                metadata          = {
                    "disable-legacy-endpoints"         = "true"
                    "google-compute-enable-virtio-rng" = "false"
                }
                oauth_scopes      = [
                    "https://www.googleapis.com/auth/compute",
                    "https://www.googleapis.com/auth/devstorage.read_only",
                    "https://www.googleapis.com/auth/logging.write",
                    "https://www.googleapis.com/auth/monitoring",
                ]
                preemptible       = false
                service_account   = "default"
                tags              = [
                    "broad-jade-perf",
                    "jade",
                    "kubernetes",
                ]
                taint             = []

                shielded_instance_config {
                    enable_integrity_monitoring = true
                    enable_secure_boot          = false
                }

                workload_metadata_config {
                    node_metadata = "GKE_METADATA_SERVER"
                }
            }

            upgrade_settings {
                max_surge       = 1
                max_unavailable = 0
            }
        }

        pod_security_policy_config {
            enabled = true
        }

        private_cluster_config {
            enable_private_endpoint = false
            enable_private_nodes    = true
            master_ipv4_cidr_block  = "10.227.0.0/28"
            peering_name            = "gke-n5dd612646658c20f0fe-92d8-b512-peer"
            private_endpoint        = "10.227.0.2"
            public_endpoint         = "35.225.67.152"
        }

        release_channel {
            channel = "REGULAR"
        }

        workload_identity_config {
            identity_namespace = "broad-jade-perf.svc.id.goog"
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `environments/perf`*
